scrolling_problem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Scrolling Problem</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">The Scrolling Problem</h1>
<p>
<a href="./index.html">Home</a>
</p>

<div id="outline-container-org39427ea" class="outline-2">
<h2 id="org39427ea">Introduction</h2>
<div class="outline-text-2" id="text-org39427ea">
<p>
We make the assumption every day that we have to scroll through our feeds. When we do a Google search, or a PubMed search if you're a biomedical researcher like me, we assume that the relevant results will be at the very top of the list. This might work for specific searches, but not broader ones. In other cases, like when we're checking the news or social media, we face an infinite, constantly updating feed. We find ourselves mindlessly scrolling through a one-dimensional list. We do this because there is no alternative.
</p>

<p>
I define this as the scrolling problem. A lot of data are presented to us as feeds, and in order to "stay updated" we have no choice but to scroll through all of it. This leads us to be reactive if the content has a clickbait element to it (flashy, outrage-inducing). This leads us to be quickly overwhelmed as the feeds force us to rapidly engage in <a href="https://en.wikipedia.org/wiki/Task_switching_(psychology)">task switching</a>, which can lead to decreased cognitive performance.
</p>

<p>
The scrolling problem is a <a href="https://en.wikipedia.org/wiki/Wicked_problem">wicked problem</a>: it is not particularly well-defined, but you know it when you see it. My strategy for solving a wicked problem is to <a href="./just_paint.html">solve a simpler but related problem</a>, so I could get some momentum going. In my case, I solved the problem of how to group related texts together in a map. This doesn't remove the need to scroll, but it does allow us to start thinking about alternatives to scrolling.
</p>
</div>
</div>

<div id="outline-container-org87b6e9b" class="outline-2">
<h2 id="org87b6e9b">From feeds to maps</h2>
<div class="outline-text-2" id="text-org87b6e9b">
<p>
Here is what viewing your feed as a map would ideally like: rather than having an endless list of tweets, posts, news articles, search results, emails, TODOs, and things of that nature, you have a map. Passages that are similar to each other are near each other based on context. A tweet about dogs and another tweet about dogs would be near each other. A tweet about cats would be near the tweets about dogs because they are related in the context of "pets."
</p>

<p>
Focusing on social media, imagine your entire twitter feed is a map. You now have more control. Different regions of the map would be about various topics, from celebrity gossip to sports to social justice. You would have control over where in your "feed" you want to go. You could be able to avoid outrage-inducing content if that's what you wish. You could focus on a particular set of topics in your feed so you don't get "sucked in."
</p>

<p>
Now imagine you're searching PubMed for every scientific paper for a particular disease you're interested in. There could be thousands of papers. Now let's say your results are a map. AI-based papers are to the northeast. Clinical trial papers are to the south. And so on, with each region of the map properly labeled. These broad searches are a good use case for the map view.
</p>
</div>
</div>

<div id="outline-container-org42844b4" class="outline-2">
<h2 id="org42844b4">My text-to-map protocol</h2>
<div class="outline-text-2" id="text-org42844b4">
<p>
The tools needed to convert text to maps are open source and readily avilable if you know how to code. My protocol revolves around the use of the BERT language model (there are alternatives, but this one works well enough and is open source). BERT is a pre-trained transformer that takes any text up to 512 words long and converts it into a 768 element vector. Broadly speaking, you can think of this high-dimensional "context space." Data scientists are used to operating with high-dimensional data like this. We know how to program computers to understand this type of data. However, for it to be human readable, we have to somehow turn these 768 dimensional coordinates into a simple XY plane that we're used to.
</p>

<p>
That's where UMAP comes in. It is a <a href="https://en.wikipedia.org/wiki/Nonlinear_dimensionality_reduction#Uniform_manifold_approximation_and_projection">non-linear dimension reduction</a> algorithm. It takes each 768 dimensional vector and converts it into a 2 dimensional vector. Vectors (texts) that are similar to each other in the 768 dimensional space will be near each other in 2 dimensions. In other words, you end up with a map, where each point on the map is a text you care about. A text that would otherwise show up as part of your endless scrolling ritual. Now you have a bit more control, as your feed is now a map. UMAp is by no means <a href="./tjb_dimr_talk.pdf">perfect</a>&#x2026;you can't perfectly compress 768 dimensions without losing information, but you'll be able to see in later sections that it is good enough to be useful in our goal of solving the scrolling problem.
</p>

<p>
There are other technicalities for the interested user (warning: jargon coming). One can do a preliminary step of determining the effective dimensionality of the data by determining how many principal components explain 95% of the variance. In my experience so far, it's roughly 1/3 of the total dimensions. This could increase both speed and accurracy given you're operating with more signal and less noise.
</p>

<p>
Additional steps are standard in unsupervised learning and useful here. Clustering the data, so we can access it at the group level is convenient here. Extracting keywords from each cluster helps us determine what clusters are the "sports" versus the "politics that will make me upset" clusters. All of this gets visualized on the map.
</p>

<p>
The map must be interactive and clickable. I'll get into this later, but I'm using the plotly package to produce such maps. The best practices (in my domain) for clickable "maps" come from flow cytometry analysis, which involve drawing "<a href="https://docs.flowjo.com/flowjo/graphs-and-gating/gw-gating/">gates</a>" around populations of interest. Flow cytometry users will most definitely find the "map" solution to the scrolling problem to be intuitive. 
</p>
</div>
</div>

<div id="outline-container-orgd7bb0e7" class="outline-2">
<h2 id="orgd7bb0e7">A map view of the news</h2>
<div class="outline-text-2" id="text-orgd7bb0e7">
<p>
The news is a high-impact low hanging fruit for this type of analysis. I am often bombarded by too much information, as well as hypernormal clickbait. I decided to make a map based on the news article titles to create a "news space" that I could query from the map view. The easiest solution to doing this was to use twitter. I collected twitter handles for the major news outlets, from CNN to BBC. I used the twitter API to collect as many tweets from each handle as I possibly could, in order to create a more nuanced "news space."
</p>
</div>

<div id="outline-container-org567b6a7" class="outline-3">
<h3 id="org567b6a7">Similar news articles are grouped near each other</h3>
<div class="outline-text-3" id="text-org567b6a7">
<p>
We start with an observation that answers the most obvious question: are the news articles being grouped together in a meaninful way? We start by looking at the overall map. The map was clustered by <a href="https://hdbscan.readthedocs.io/en/latest/how_hdbscan_works.html">hierarchical dbscan</a>, an algorithm developed by Leland Mciness to be used along with UMAP. It is not necessarily the optimal clustering algorithm to be used here, but it's a good place to start. Below is what the map looks like:
</p>

<br>
<h2>This is the footer.</h2>
<p>You can put stuff here.</p>
<br>
</div>
</div>
</div>

<div id="outline-container-org316ee23" class="outline-2">
<h2 id="org316ee23">CNN vs Fox News: overlap in "news space"</h2>
<div class="outline-text-2" id="text-org316ee23">
<p>
COMING SOON. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: July 15, 2022 - July 15, 2022</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
